/*
Операция rest для сбора всех аргументов функции

Операция ... (rest) позволяет собрать группу независимых элементов в новую коллекцию. 
Синтаксически это близнец операции распыления, но отличить их просто - распыление это когда 
... находится в правой части операции присваивания, а сбор это когда ... находится в её левой части.

Вернёмся к аналогии с яблоками. Если на полу лежат яблоки и у нас есть пустой ящик, то операция 
rest позволит «собрать» яблоки в ящик. При этом оригинальные яблоки останутся на полу, а в ящике 
будет копия каждого яблока.

Одна из областей применения операции rest это создание функций которые могут принимать произвольное 
количество аргументов.

// Как объявить параметры функции так,
// чтобы можно было передать любое кол-во аргументов?
function multiply() {
  // ...
}

multiply(1, 2);
multiply(1, 2, 3);
multiply(1, 2, 3, 4);
Если убрать весь «синтаксический шум» и посмотреть на аргументы и параметры функции, то аргументы 
находятся в правой части операции присваивания, а параметры в левой, потому что значения аргументов 
присваиваются объявленным параметрам. Значит можно «собрать» все аргументы функции в один параметр 
используя операцию rest.

function multiply(...args) {
  console.log(args); // массив всех аргументов
}

multiply(1, 2);
multiply(1, 2, 3);
multiply(1, 2, 3, 4);   // [1, 2, 3, 4]
Имя параметра может быть произвольным. Чаще всего его называют args, restArgs или otherArgs, 
сокращённое от arguments.


Используя операцию rest дополни код функции add() так, чтобы она принимала любое количество 
аргументов, считала и возвращала их сумму.
*/
// Change code below this line
function add(...args) {
 
    let sum = 0;
    for (const arg of args) {
        sum+= arg;
    }

    return sum;
    
  // Change code above this line
}
console.log('31- ...args  add(12, 4, 11, 48) is ', add(12, 4, 11, 48));




